Revit 2027 API
RebarBarType Methods
The RebarBarType type exposes the following members.
Methods
Name | Description
ArePhasesModifiable |  Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.
(Inherited from Element)
CanBeHidden | Indicates if the element can be hidden in the view.
(Inherited from Element)
CanBeLocked |  Identifies if the element can be locked.
(Inherited from Element)
CanCrankParametersBeComputedUsingCrankAngledLength |  Identifies if the all crank parameters can be computed for the specified crank angled length and Rebar Crank Type.
CanCrankParametersBeComputedUsingCrankOffsetLength |  Identifies if the all crank parameters can be computed for the specified crank offset length and Rebar Crank Type.
CanCrankParametersBeComputedUsingCrankRatio |  Identifies if the all crank parameters can be computed for the specified crank ratio and Rebar Crank Type.
CanCrankParametersBeComputedUsingCrankStraightLength |  Identifies if the all crank parameters can be computed for the specified crank straight length and Rebar Crank Type.
CanDeleteSubelement |  Checks if given subelement can be removed from the element.
(Inherited from Element)
CanHaveTypeAssigned() |  Identifies if the element can have a type assigned.
(Inherited from Element)
ChangeTypeId(ElementId) |  Changes the type of the element.
(Inherited from Element)
Create |  Creates a new RebarBarType object
CreateDefaultRebarBarType |  Creates a new RebarBarType object with a default name.
DeleteEntity |  Deletes the existing entity created by %schema% in the element
(Inherited from Element)
DeleteSubelement |  Removes a subelement from the element.
(Inherited from Element)
DeleteSubelements |  Removes the subelements from the element.
(Inherited from Element)
Dispose
(Inherited from Element)
Duplicate |  Duplicates an existing element type and assigns it a new name.
(Inherited from ElementType)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
EvaluateAllParameterValues |  Evaluates all the parameters' values of the element.
(Inherited from Element)
EvaluateParameterValues |  Evaluate the parameters' values of the element on the given parameter ID set.
(Inherited from Element)
GetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
GetAutoCalculatedCrank |  Identifies if the crank dimensions are auto calculated for the specified Rebar Crank Type.
GetAutoCalculatedLapLength |  Identifies if the lap length is auto calculated for the specified Rebar Splice Type.
GetAutoCalculatedStaggerLength |  Identifies if the stagger length is auto calculated for the specified Rebar Splice Type.
GetCrankAngledLength |  Gets the crank angled length taking into account the specified Rebar Crank Type.
GetCrankLength |  Gets the crank length taking into account the specified Rebar Crank Type.
GetCrankOffsetLength |  Gets the crank offset taking into account the specified Rebar Crank Type.
GetCrankRatio |  Gets the crank ratio taking into account the specified Rebar Crank Type.
GetCrankStraightLength |  Gets the crank straigth length taking into account the specified Rebar Crank Type.
GetDependentElements |  Get all elements that, from a logical point of view, are the children of this Element.
(Inherited from Element)
GetEntity |  Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.
(Inherited from Element)
GetEntitySchemaGuids |  Returns the Schema guids of any Entities stored in this element.
(Inherited from Element)
GetExternalFileReference |  Gets information pertaining to the external file referenced by the element.
(Inherited from Element)
GetExternalResourceReference |  Gets the ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferenceExpanded |  Gets the collection of ExternalResourceReference associated with a specified external resource type.
(Inherited from Element)
GetExternalResourceReferences |  Gets the map of the external resource references referenced by the element.
(Inherited from Element)
GetExternalResourceReferencesExpanded |  Gets the expanded map of the external resource references referenced by the element.
(Inherited from Element)
GetGeneratingElementIds |  Returns the ids of the element(s) that generated the input geometry object.
(Inherited from Element)
GetGeometryObjectFromReference |  Retrieve one geometric primitive contained in the element given a reference.
(Inherited from Element)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetHookLength |  Identifies the hook length for a hook type
GetHookOffsetLength |  Identifies the hook offset length for a hook type
GetHookPermission |  Identifies if a hook type is permitted for this bar type
GetHookTangentLength |  Identifies the hook tangent length for a hook type
GetLapLength |  Gets the lap length taking into account the specified Rebar Splice Type.
GetMaterialArea |  Gets the area of the material with the given id.
(Inherited from Element)
GetMaterialIds |  Gets the element ids of all materials present in the element.
(Inherited from Element)
GetMaterialVolume |  Gets the volume of the material with the given id.
(Inherited from Element)
GetMonitoredLinkElementIds |  Provides the link instance IDs when the element is monitoring.
(Inherited from Element)
GetMonitoredLocalElementIds |  Provides the local element IDs when the element is monitoring.
(Inherited from Element)
GetOrderedParameters |  Gets the parameters associated to the element in order.
(Inherited from Element)
GetParameter | Retrieves a parameter from the element given identifier.
(Inherited from Element)
GetParameterFormatOptions |  Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.
(Inherited from Element)
GetParameters | Retrieves the parameters from the element via the given name.
(Inherited from Element)
GetPhaseStatus |  Gets the status of a given element in the input phase
(Inherited from Element)
GetPreviewImage | Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element.
(Inherited from ElementType)
GetReinforcementRoundingManager |  Returns an object for managing reinforcement rounding override settings.
GetSimilarTypes |  Obtains a set of types that are similar to this type.
(Inherited from ElementType)
GetStaggerLength |  Gets the stagger length taking into account the specified Rebar Splice Type.
GetSubelements |  Returns the collection of element subelements.
(Inherited from Element)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetTypeId |  Returns the identifier of this element's type.
(Inherited from Element)
GetValidTypes() |  Obtains a set of types that are valid for this element.
(Inherited from Element)
HasPhases |  Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.
(Inherited from Element)
IsCreatedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsDemolishedPhaseOrderValid |  Returns true if createdPhaseId and demolishedPhaseId are in order.
(Inherited from Element)
IsExternalFileReference |  Determines whether this Element represents an external file.
(Inherited from Element)
IsHidden | Identifies if the element has been permanently hidden in the view.
(Inherited from Element)
IsMonitoringLinkElement |  Indicate whether an element is monitoring any elements in any linked models.
(Inherited from Element)
IsMonitoringLocalElement |  Indicate whether an element is monitoring other local elements.
(Inherited from Element)
IsPhaseCreatedValid |  Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.
(Inherited from Element)
IsPhaseDemolishedValid |  Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
(Inherited from Element)
IsSimilarType |  Checks if given type is similar to this type.
(Inherited from ElementType)
IsValidDefaultFamilyType |  Identifies if this type is a valid default family type for the given family category id.
(Inherited from ElementType)
IsValidType(ElementId) |  Checks if given type is valid for this element.
(Inherited from Element)
LookupParameter | Attempts to find a parameter on the element which has the given name.
(Inherited from Element)
RefersToExternalResourceReference |  Determines whether this Element uses external resources associated with a specified external resource type.
(Inherited from Element)
RefersToExternalResourceReferences |  Determines whether this Element uses external resources.
(Inherited from Element)
SetAutoCalcHookLengths |  Identifies if the hook lengths of a hook type are automatically calculated for this bar type
SetAutoCalculatedCrank |  Sets if the crank dimensions are auto calculated or not for the specified Rebar Crank Type.
SetAutoCalculatedLapLength |  Sets if the lap length is auto calculated or not for the specified Rebar Splice Type.
SetAutoCalculatedStaggerLength |  Sets if the stagger length is auto calculated or not for the specified Rebar Splice Type.
SetBarTypeDiameters |  Sets all input diameters from diametersOptions in current RebarBarType.
SetCrankAngledLength |  Sets the crank angled length for the specified Rebar Crank Type.
SetCrankLength |  Sets the crank length for the specified Rebar Crank Type.
SetCrankOffsetLength |  Sets the crank offset length for the specified Rebar Crank Type.
SetCrankRatio |  Sets the crank ratio for the specified Rebar Crank Type.
SetCrankStraightLength |  Sets the crank straigh length for the specified Rebar Crank Type.
SetEntity |  Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
(Inherited from Element)
SetHookLength |  Identifies the hook length for a hook type
SetHookOffsetLength |  Identifies the hook offset length for a hook type
SetHookPermission |  Identifies if a hook type is permitted for this bar type
SetHookTangentLength |  Identifies the hook tangent length for a hook type
SetLapLength |  Sets the lap length for the specified Rebar Splice Type.
SetStaggerLength |  Sets the stagger length for the specified Rebar Splice Type.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace